/* 一開始有１台機器，機器產量是每日１塊餅乾且可以添購新機器來增加產量但每購買一台需要多花一塊餅乾(第ｎ台耗費ｎ塊)
 * 但購買的當天機器需要安裝，所以無法產出，問第ｘ天時餅乾最多的總量？
 * 解題關鍵：(1)暴力法找最大值 (2)微分
 * 第ｘ天時Ｎ台機器的產值是 ƒ(N)＝N(x-2N+2) 塊餅乾，已知ｘ時，maximize{ ƒ(N)} 
 * 極值存在一次微分斜率＝０時，因為Ｎ是整數所以極點若不是整數時則取最近的值 → x=4N-2
 */
#include<bits/stdc++.h>
using namespace std;

int main(){
  int caseT, xDay, dN;
  scanf("%d\n",&caseT);
  while(caseT-->0){
    scanf("%d\n",&xDay);
    /*
    dN=(xDay+2)>>2;
    ans=dN*(xDay-2*dN+2);
    */
    int ans_max=xDay;
    for(int dN=2; xDay-2*dN>=2;dN++)
      ans_max=max(ans_max,dN*(xDay-2*dN+2));
    printf("%d\n",ans_max);
  }
}



/*  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 => x
 *        2  4  6  8 10 12 14 16 18 20 22 24 26 28 30 32 34 36 => 2(x-2)
 *              3  6  9 12 15 18 21 24 27 30 33 36 39 42 45 48 => 3(x-4)
 *                    4  8 12 16 20 24 28 32 36 40 44 48 52 56 => 4(x-6)
 *                          5 10 15 20 25 30 35 40 45 50 55 60 => 5(x-8)
 *                                6 12 18 24 30 36 42 48 54 60 => 6(x-10)
 *                                                             => N(x-2N+2)
 */