// 第x天時N台機器的產值是 ƒ(x)=N(x-2N+2) 塊餅乾。
// 題目要求最大化ƒ(x) => 一次微分找極點(落在整數) => x=4N-2
// 測資輸入說明有誤(要讀取直到沒有輸入為止，caseT沒作用= =)

#include<iostream>
using namespace std;

int main(){
  ios::sync_with_stdio(0),
  cin.tie(0), cout.tie(0);

  int caseT, xDay, Num;
  cin>>caseT;
  while(cin>>xDay){
    Num=(xDay+2)>>2;
    Num=Num+(xDay-(Num<<2)>0);
    cout<<Num*(xDay-2*Num+2)<<'\n';
  }
}



/*  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 => x
 *        2  4  6  8 10 12 14 16 18 20 22 24 26 28 30 32 34 36 => 2(x-2)
 *              3  6  9 12 15 18 21 24 27 30 33 36 39 42 45 48 => 3(x-4)
 *                    4  8 12 16 20 24 28 32 36 40 44 48 52 56 => 4(x-6)
 *                          5 10 15 20 25 30 35 40 45 50 55 60 => 5(x-8)
 *                                6 12 18 24 30 36 42 48 54 60 => 6(x-10)
 *                                                             => N(x-2N+2)
 */